In [1]:
# Supress Warnings

import warnings
warnings.filterwarnings('ignore')

In [2]:
# Import the numpy and pandas packages

import numpy as np
import pandas as pd

## Checkpoint 1: Data Cleaning

Import and read the companies.txt and rounds2.csv. Store it in a variables called `companies` and `rounds2`.

In [3]:
companies = pd.read_csv("companies.txt", sep="\t", encoding = "ISO-8859-1")
companies.head()

,permalink,name,homepage_url,category_list,status,country_code,state_code,region,city,founded_at
0,/Organization/-Fame,#fame,http://livfame.com,Media,operating,IND,16,Mumbai,Mumbai,NaN
1,/Organization/-Qounter,:Qounter,http://www.qounter.com,Application Platforms|Real Time|Social Network...,operating,USA,DE,DE - Other,Delaware City,04-09-2014
2,/Organization/-The-One-Of-Them-Inc-,"(THE) ONE of THEM,Inc.",http://oneofthem.jp,Apps|Games|Mobile,operating,NaN,NaN,NaN,NaN,NaN
3,/Organization/0-6-Com,0-6.com,http://www.0-6.com,Curated Web,operating,CHN,22,Beijing,Beijing,01-01-2007
4,/Organization/004-Technologies,004 Technologies,http://004gmbh.de/en/004-interact,Software,operating,USA,IL,"Springfield, Illinois",Champaign,01-01-2010

In [4]:
rounds2 = pd.read_csv("rounds2.csv", encoding = "ISO-8859-1")
rounds2.head()

,company_permalink,funding_round_permalink,funding_round_type,funding_round_code,funded_at,raised_amount_usd
0,/organization/-fame,/funding-round/9a01d05418af9f794eebff7ace91f638,venture,B,05-01-2015,10000000.0
1,/ORGANIZATION/-QOUNTER,/funding-round/22dacff496eb7acb2b901dec1dfe5633,venture,A,14-10-2014,NaN
2,/organization/-qounter,/funding-round/b44fbb94153f6cdef13083530bb48030,seed,NaN,01-03-2014,700000.0
3,/ORGANIZATION/-THE-ONE-OF-THEM-INC-,/funding-round/650b8f704416801069bb178a1418776b,venture,B,30-01-2014,3406878.0
4,/organization/0-6-com,/funding-round/5727accaeaa57461bd22a9bdd945382d,venture,A,19-03-2008,2000000.0

In [5]:
# Encoding and decoding company_permalink column to remove special characters and converting it to lower case

rounds2.company_permalink = rounds2.company_permalink.str.encode('utf-8').str.decode('ascii', 'ignore').str.lower()

In [6]:
# Counting the unique values in company_permalink of rounds2

rounds2.company_permalink.nunique()

66368

In [7]:
# Encoding and decoding permalink column to remove special characters and converting it to lower case

companies.permalink = companies.permalink.str.encode('utf-8').str.decode('ascii', 'ignore').str.lower()

In [8]:
# Counting the unique values in permalink of companies

companies.permalink.nunique()

66368

In [9]:
# Inspecting companies dataframe

companies.info()

# As Companies has total rows 66368 and only two column has all the value (i.e permalink and status)
# By looking at data status has duplicate values and permalink doesnot have any duplicate value
# We can consider permalink as unique for each company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66368 entries, 0 to 66367
Data columns (total 10 columns):
permalink        66368 non-null object
name             66367 non-null object
homepage_url     61310 non-null object
category_list    63220 non-null object
status           66368 non-null object
country_code     59410 non-null object
state_code       57821 non-null object
region           58338 non-null object
city             58340 non-null object
founded_at       51147 non-null object
dtypes: object(10)
memory usage: 5.1+ MB

In [10]:
rounds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114949 entries, 0 to 114948
Data columns (total 6 columns):
company_permalink          114949 non-null object
funding_round_permalink    114949 non-null object
funding_round_type         114949 non-null object
funding_round_code         31140 non-null object
funded_at                  114949 non-null object
raised_amount_usd          94959 non-null float64
dtypes: float64(1), object(5)
memory usage: 5.3+ MB

In [11]:
# Checking difference in company_permalink column of round2 dataframe and permalink column of companies dataframe

set(rounds2.company_permalink.tolist())-set(companies.permalink.tolist())

# We the empty set hence
# All companies in round2 is in companies

set()

In [12]:
# Renaming the column company_permalink to permalink of rounds2 dataframe

rounds2.rename(columns={'company_permalink': 'permalink'}, inplace=True)

In [13]:
# Merging rounds2 and companies dataframe on permalink

master_frame = pd.merge(rounds2, companies, how='inner', on='permalink')

In [14]:
# Finding the observations of master_frame

master_frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114949 entries, 0 to 114948
Data columns (total 15 columns):
permalink                  114949 non-null object
funding_round_permalink    114949 non-null object
funding_round_type         114949 non-null object
funding_round_code         31140 non-null object
funded_at                  114949 non-null object
raised_amount_usd          94959 non-null float64
name                       114948 non-null object
homepage_url               108815 non-null object
category_list              111539 non-null object
status                     114949 non-null object
country_code               106271 non-null object
state_code                 104003 non-null object
region                     104782 non-null object
city                       104785 non-null object
founded_at                 94428 non-null object
dtypes: float64(1), object(14)
memory usage: 14.0+ MB

In [15]:
# Removing unwanted columns from master_frame

master_frame.drop('funding_round_permalink', axis=1, inplace= True)
master_frame.drop('funding_round_code', axis=1, inplace= True)
master_frame.drop('funded_at', axis=1, inplace= True)
master_frame.drop('name', axis=1, inplace= True)
master_frame.drop('homepage_url', axis=1, inplace= True)
master_frame.drop('status', axis=1, inplace= True)
master_frame.drop('state_code', axis=1, inplace= True)
master_frame.drop('region', axis=1, inplace= True)
master_frame.drop('founded_at', axis=1, inplace= True)

master_frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114949 entries, 0 to 114948
Data columns (total 6 columns):
permalink             114949 non-null object
funding_round_type    114949 non-null object
raised_amount_usd     94959 non-null float64
category_list         111539 non-null object
country_code          106271 non-null object
city                  104785 non-null object
dtypes: float64(1), object(5)
memory usage: 6.1+ MB

## Checkpoint 2: Funding Type Analysis

In [16]:
# Checking null values

master_frame.isnull().sum()

permalink                 0
funding_round_type        0
raised_amount_usd     19990
category_list          3410
country_code           8678
city                  10164
dtype: int64

In [17]:
# Removing rows with null value in raised_amount_usd

master_frame = master_frame[~np.isnan(master_frame['raised_amount_usd'])]
master_frame.isnull().sum()

permalink                0
funding_round_type       0
raised_amount_usd        0
category_list         1044
country_code          5851
city                  7045
dtype: int64

In [18]:
# Creating the groups in master_frame by funding_round_type

master_frame_by_funding_amount = master_frame.groupby('funding_round_type')

In [19]:
# Finding the average of raised_amount_usd in funding round type groups

master_frame_by_funding_amount['raised_amount_usd'].mean().sort_values(ascending = False)

# Venture has the highest amoung (private_equity, venture, angel, seed) and in range of 5 million to 15 millions

funding_round_type
post_ipo_debt            1.687046e+08
post_ipo_equity          8.218249e+07
secondary_market         7.964963e+07
private_equity           7.330859e+07
undisclosed              1.924237e+07
debt_financing           1.704353e+07
venture                  1.174895e+07
grant                    4.300576e+06
convertible_note         1.453439e+06
product_crowdfunding     1.363131e+06
angel                    9.586945e+05
seed                     7.198180e+05
equity_crowdfunding      5.383682e+05
non_equity_assistance    4.112031e+05
Name: raised_amount_usd, dtype: float64

## Checkpoint 3: Funding Type Analysis

In [20]:
# Creating new data frame master_frame_for_venture containing funding_round_tye Venture only

master_frame_for_venture = master_frame.loc[master_frame.funding_round_type == 'venture']
master_frame_for_venture.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city
0,/organization/-fame,venture,10000000.0,Media,IND,Mumbai
3,/organization/-the-one-of-them-inc-,venture,3406878.0,Apps|Games|Mobile,NaN,NaN
4,/organization/0-6-com,venture,2000000.0,Curated Web,CHN,Beijing
8,/organization/0ndine-biomedical-inc,venture,719491.0,Biotechnology,CAN,Vancouver
10,/organization/0xdata,venture,20000000.0,Analytics,USA,Mountain View

In [21]:
# Grouping master_frame_for_venture by country_code

master_frame_by_country = master_frame_for_venture.groupby('country_code')

In [22]:
# Creating new dataframe named top9 with the top nine countries based on the total investment amount each country has received

top9=master_frame_by_country.raised_amount_usd.sum().sort_values(ascending = False).head(9)
top9

# Top three English-speaking countries are :- USA, GBR, IND

country_code
USA    4.225108e+11
CHN    3.983542e+10
GBR    2.024563e+10
IND    1.439186e+10
CAN    9.583332e+09
FRA    7.259537e+09
ISR    6.907515e+09
DEU    6.346960e+09
JPN    3.363677e+09
Name: raised_amount_usd, dtype: float64

## Checkpoint 4: Sector Analysis 1

### Reading mapping.csv and storing in variable `mapping`

In [23]:
# Reading mapping.csv 
mapping = pd.read_csv("mapping.csv")
mapping.head()

,category_list,Automotive & Sports,Blanks,Cleantech / Semiconductors,Entertainment,Health,Manufacturing,"News, Search and Messaging",Others,"Social, Finance, Analytics, Advertising"
0,NaN,0,1,0,0,0,0,0,0,0
1,3D,0,0,0,0,0,1,0,0,0
2,3D Printing,0,0,0,0,0,1,0,0,0
3,3D Technology,0,0,0,0,0,1,0,0,0
4,Accounting,0,0,0,0,0,0,0,0,1

In [24]:
# Removing row with NAN i.e first one

mapping = mapping[~pd.isnull(mapping['category_list'])]

In [25]:
# Reshaping the mapping data

reshaped_mapping = pd.melt(mapping, id_vars=["category_list"],var_name="main_sector", value_name="present")

In [26]:
# Removing rows values with 0 in presnet column

mapping_data = reshaped_mapping[reshaped_mapping.present == 1]

In [27]:
# Correcting the data as some name in catgeory contains 0 in place of na as Fi0nce it should be Finance

mapping_data['category_list'] = mapping_data['category_list'].str.replace('0','na')
mapping_data.head()

       category_list          main_sector  present
7   Adventure Travel  Automotive & Sports        1
13         Aerospace  Automotive & Sports        1
44              Auto  Automotive & Sports        1
45   Automated Kiosk  Automotive & Sports        1
46        Automotive  Automotive & Sports        1

In [28]:
# Dropping column present we don't need it now

mapping_data = mapping_data.drop('present', axis=1)

In [29]:
# Renaming column category_list to primary_sector

mapping_data.rename(columns={'category_list': 'primary_sector'}, inplace=True)
mapping_data.head()

      primary_sector          main_sector
7   Adventure Travel  Automotive & Sports
13         Aerospace  Automotive & Sports
44              Auto  Automotive & Sports
45   Automated Kiosk  Automotive & Sports
46        Automotive  Automotive & Sports

In [30]:
# Adding new column named primary_sector in master_frame by taking first value in category_list column

master_frame['primary_sector'] = master_frame['category_list'].str.split('|').str[0]
master_frame.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city,primary_sector
0,/organization/-fame,venture,10000000.0,Media,IND,Mumbai,Media
2,/organization/-qounter,seed,700000.0,Application Platforms|Real Time|Social Network...,USA,Delaware City,Application Platforms
3,/organization/-the-one-of-them-inc-,venture,3406878.0,Apps|Games|Mobile,NaN,NaN,Apps
4,/organization/0-6-com,venture,2000000.0,Curated Web,CHN,Beijing,Curated Web
6,/organization/01games-technology,undisclosed,41250.0,Games,HKG,Hong Kong,Games

In [31]:
# Merging master_frame and mapping_data

merged_frame = pd.merge(master_frame, mapping_data, how='inner', on='primary_sector')
merged_frame.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city,primary_sector,main_sector
0,/organization/-fame,venture,10000000.0,Media,IND,Mumbai,Media,Entertainment
1,/organization/90min,venture,15000000.0,Media|News|Publishing|Soccer|Sports,GBR,London,Media,Entertainment
2,/organization/90min,venture,5800000.0,Media|News|Publishing|Soccer|Sports,GBR,London,Media,Entertainment
3,/organization/90min,venture,18000000.0,Media|News|Publishing|Soccer|Sports,GBR,London,Media,Entertainment
4,/organization/a-dance-for-me,equity_crowdfunding,1090000.0,Media|News|Photo Sharing|Video,USA,Missoula,Media,Entertainment

## Checkpoint 5: Sector Analysis 2

### Creating new dataframes D1, D2 and D3 for each of the three countries 
### containing the observations of funding type venture falling within the 5-15 million USD range

In [32]:
D1 = merged_frame.loc[(merged_frame.funding_round_type == 'venture') & (merged_frame.country_code == 'USA') 
                          & (merged_frame.raised_amount_usd >= 5000000) & (merged_frame.raised_amount_usd <= 15000000),:]
D2 = merged_frame.loc[(merged_frame.funding_round_type == 'venture') & (merged_frame.country_code == 'GBR') 
                          & (merged_frame.raised_amount_usd >= 5000000) & (merged_frame.raised_amount_usd <= 15000000),:]
D3 = merged_frame.loc[(merged_frame.funding_round_type == 'venture') & (merged_frame.country_code == 'IND') 
                          & (merged_frame.raised_amount_usd >= 5000000) & (merged_frame.raised_amount_usd <= 15000000),:]

In [33]:
# Adding number_of_inv and amnt_invested columns to D1 containing count of investments and total amount invested in each sector

D1['number_of_inv'] = D1.groupby('main_sector')['main_sector'].transform('count')
D1['amnt_invested'] = D1.raised_amount_usd.groupby(D1.main_sector).transform('sum')
D1.sort_values(['number_of_inv'],ascending = False, inplace= True)
D1.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city,primary_sector,main_sector,number_of_inv,amnt_invested
93563,/organization/user-interface,venture,8250000.0,User Interface,USA,California City,User Interface,Others,2950,2.632101e+10
41728,/organization/m3-technology-group,venture,6500000.0,Enterprise Software,USA,Charlotte,Enterprise Software,Others,2950,2.632101e+10
41712,/organization/logrhythm,venture,10000000.0,Enterprise Software,USA,Boulder,Enterprise Software,Others,2950,2.632101e+10
41709,/organization/loggly,venture,15000000.0,Enterprise Software,USA,San Francisco,Enterprise Software,Others,2950,2.632101e+10
41708,/organization/loggly,venture,9900000.0,Enterprise Software,USA,San Francisco,Enterprise Software,Others,2950,2.632101e+10

In [34]:
# Adding number_of_inv and amnt_invested columns to D2 containing count of investments and total amount invested in each sector

D2['number_of_inv'] = D2.groupby('main_sector')['main_sector'].transform('count')
D2['amnt_invested'] = D2.raised_amount_usd.groupby(D2.main_sector).transform('sum')
D2.sort_values(['number_of_inv'],ascending = False, inplace= True)
D2.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city,primary_sector,main_sector,number_of_inv,amnt_invested
25040,/organization/myoptique-group,venture,14656237.0,E-Commerce,GBR,London,E-Commerce,Others,147,1.283624e+09
39215,/organization/site-intelligence,venture,7000000.0,Software,GBR,Oxton,Software,Others,147,1.283624e+09
66415,/organization/native-networks,venture,11500000.0,Networking,GBR,Coventry,Networking,Others,147,1.283624e+09
38868,/organization/rootstock-software,venture,5750000.0,Software,GBR,Milton Keynes,Software,Others,147,1.283624e+09
38809,/organization/rhetorical-systems,venture,6282049.0,Software,GBR,Edinburgh,Software,Others,147,1.283624e+09

In [35]:
# Adding number_of_inv and amnt_invested columns to D3 containing count of investments and total amount invested in each sector

D3['number_of_inv'] = D3.groupby('main_sector')['main_sector'].transform('count')
D3['amnt_invested'] = D3.raised_amount_usd.groupby(D3.main_sector).transform('sum')
D3.sort_values(['number_of_inv'],ascending = False, inplace= True)
D3.head()

,permalink,funding_round_type,raised_amount_usd,category_list,country_code,city,primary_sector,main_sector,number_of_inv,amnt_invested
81253,/organization/trucksfirst,venture,10000000.0,Logistics|Logistics Company|Services,IND,Gurgaon,Logistics,Others,110,1.013410e+09
29599,/organization/hippocampus-learning-centres,venture,13000000.0,Education,IND,Bangalore,Education,Others,110,1.013410e+09
26080,/organization/tastykhana,venture,5000000.0,E-Commerce|Internet,IND,Pune,E-Commerce,Others,110,1.013410e+09
26085,/organization/teabox,venture,6000000.0,E-Commerce|Specialty Foods,IND,Darjeeling,E-Commerce,Others,110,1.013410e+09
26346,/organization/urban-ladder,venture,5000000.0,E-Commerce|Furniture|Home Decor|Home & Garden|...,IND,Bangalore,E-Commerce,Others,110,1.013410e+09

### Finding total number of investments

In [36]:
# Total number of investments in D1

D1.permalink.count()

12012

In [37]:
# Total number of investments in D2

D2.permalink.count()

619

In [38]:
# Total number of investments in D3

D3.permalink.count()

328

### Total amount of investments

In [39]:
# Total amount of investments in D1

D1.raised_amount_usd.sum()

107318294664.0

In [40]:
# Total amount of investments in D1

D2.raised_amount_usd.sum()

5365228300.0

In [41]:
# Total amount of investments in D1

D3.raised_amount_usd.sum()

2949543602.0

### Top sector based on count of investments

In [42]:
# Top sectors in D1

D1.groupby('main_sector')['raised_amount_usd'].count().reset_index(name='count').sort_values(['count'], ascending=False)

                               main_sector  count
6                                   Others   2950
7  Social, Finance, Analytics, Advertising   2714
1               Cleantech / Semiconductors   2300
5               News, Search and Messaging   1582
3                                   Health    909
4                            Manufacturing    799
2                            Entertainment    591
0                      Automotive & Sports    167

In [43]:
# Top sectors in D2

D2.groupby('main_sector')['raised_amount_usd'].count().reset_index(name='count').sort_values(['count'], ascending=False)

                               main_sector  count
6                                   Others    147
7  Social, Finance, Analytics, Advertising    133
1               Cleantech / Semiconductors    128
5               News, Search and Messaging     73
2                            Entertainment     56
4                            Manufacturing     42
3                                   Health     24
0                      Automotive & Sports     16

In [44]:
# Top sectors in D3

D3.groupby('main_sector')['raised_amount_usd'].count().reset_index(name='count').sort_values(['count'], ascending=False)

                               main_sector  count
6                                   Others    110
7  Social, Finance, Analytics, Advertising     60
5               News, Search and Messaging     52
2                            Entertainment     33
4                            Manufacturing     21
1               Cleantech / Semiconductors     20
3                                   Health     19
0                      Automotive & Sports     13

### which company received the highest investment

In [45]:
# For the top sectors count-wise, company received the highest investment for D1

d1s1 = D1.loc[D1.main_sector == 'Others']
top_company_d1s1 = d1s1.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d1s1.head(3)

                            permalink      amount
1942        /organization/virtustream  64300000.0
309             /organization/capella  54968051.0
50    /organization/airtight-networks  54201907.0

In [46]:
# For the top sectors count-wise, company received the highest investment for D2

d2s1 = D2.loc[D2.main_sector == 'Others']
top_company_d2s1 = d2s1.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d2s1.head(3)

                       permalink      amount
35  /organization/electric-cloud  37000000.0
87         /organization/sensage  36250000.0
36       /organization/enigmatic  32500000.0

In [47]:
# For the top sectors count-wise, company received the highest investment for D3

d3s1 = D3.loc[D3.main_sector == 'Others']
top_company_d3s1 = d3s1.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d3s1.head(3)

                     permalink      amount
27  /organization/firstcry-com  39000000.0
48        /organization/myntra  38000000.0
16   /organization/commonfloor  32900000.0

In [48]:
# For the second best sectors count-wise, company received the highest investment for D1
d1s2 = D1.loc[D1.main_sector == 'Social, Finance, Analytics, Advertising']
top_company_d1s2 = d1s2.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d1s2.head(3)

                      permalink      amount
1430  /organization/shotspotter  67933006.0
461    /organization/demandbase  63000000.0
775       /organization/intacct  61800000.0

In [49]:
# For the second best sectors count-wise, company received the highest investment for D2

d2s2 = D2.loc[D2.main_sector == 'Social, Finance, Analytics, Advertising']
top_company_d2s2 = d2s2.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d2s2.head(3)

                               permalink      amount
21   /organization/celltick-technologies  37500000.0
59                /organization/mythings  34000000.0
103                   /organization/zopa  32900000.0

In [50]:
# For the second best sectors count-wise, company received the highest investment for D3

d3s2 = D3.loc[D3.main_sector == 'Social, Finance, Analytics, Advertising']
top_company_d3s2 = d3s2.groupby('permalink')['raised_amount_usd'].sum().reset_index(name='amount').sort_values(['amount'], ascending=False)
top_company_d3s2.head(3)

                        permalink      amount
31  /organization/manthan-systems  50700000.0
28      /organization/komli-media  28000000.0
41    /organization/shopclues-com  25000000.0